testing/load/scenarios/single-user.yml
config:
  target: "http://192.168.1.36:4000"
  phases:
    - duration: 60
      arrivalRate: 1
      name: "Single user test"

scenarios:
  - name: "Complete User Flow"
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "test@guild.app"
            password: "TestPass123!"
      - get:
          url: "/api/v1/user/profile"
      - get:
          url: "/api/v1/jobs?limit=5"
      - get:
          url: "/api/v1/chat/conversations"
      - post:
          url: "/api/v1/user/profile/update"
          json:
            lastActive: "{{ $timestamp }}"